app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "desc", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "cdv"], ["desc", "edver"], ["created_at", "2023-03-08 12:14:26.261228"], ["updated_at", "2023-03-08 12:14:26.261228"]]
---
    def create
        @article = Article.new(article_params)

        if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "desc" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["desc", "mahesh"], ["updated_at", "2023-03-04 12:53:13.361445"], ["id", 1]]
---
    def update
        @article = Article.find(params[:id])
        if @article.update(article_params)