app/controllers/comments_controller.rb

  def create
    @comment = @article.comments.new(comment_params)
    if @comment.save
---
INSERT INTO "comments" ("body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "fdsaf"], ["article_id", 17], ["created_at", "2023-03-08 12:39:38.471382"], ["updated_at", "2023-03-08 12:39:38.471382"]]

  def set_post
    @article = Article.find(params[:article_id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]